Revit 2025 API
gbXMLBuildingHVACSystem Enumeration
 Enumerations for gbXML (Green Building XML) format, used for energy analysis, schema version 0.34.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum gbXMLBuildingHVACSystem
Public Enumeration gbXMLBuildingHVACSystem
public enum class gbXMLBuildingHVACSystem
type gbXMLBuildingHVACSystem
Members
Member name | Value | Description
TwelveSEERSPointNineAFUESplitPackagedGasFiveToElevenTon | 0
ElevenPointThreeEERPackagedVAVEightyFourPointFourPercentBoilerHeating | 1
CentralVAVHWHeatChillerFivePointNinetySixCOPBoilersEightyFourPoint5Eff | 2
FourPipeFanCoilSystemChillerFivePointNinetySixCOPBoilersEightFourPointFiveEff | 3
CentralVAVElectricResistanceHeatChillerFivePointNinetySixCOP | 4
TwelveSEERSevenPointSevenHSPFSplitPackagedHeatPump | 5
TwoPipeFanCoilSystemChillerFivePointNinetySixCOPBoilersEightyFourPointFiveEff | 6
TwelveSEEREightPointThreeHSPFPackagedTerminalHeatPumpPTAC | 7
ResidentialSeventeenSEERNinePointSixHSPFSplitHPLessThanFivePointFiveTon | 8
UnderfloorAirDistribution | 9
ResidentialFourteenSEERPointNineAFUESplitPackagedGasLessThanFivePointFiveTon | 10
ResidentialFourteenSEEREightPointThreeHSPFSplitPackagedHeatPump | 11
NoOfHVACSystemEnums | 12
Remarks
 This enumeration corresponds to the HVAC System attribute in gbXML and is used to specify the Building HVAC System.
See Also
Reference
Autodesk.Revit.DB.Analysis Namespace